[
{"s0":"<p class='help'>The starting point is the creation of an App within the developer portal at https://dev.freeagent.com/login. Once the App has been created, click on it within the portal to edit it, and two keys should become visible: 'OAuth identifier' and 'OAuth secret'.</p><div class='step-image1'></div><p class='help'>Both are strings of text looking something like this 'MyeuHkExlB8nJrdx6mTDyA'.  Copy both keys and paste them into a Word document or a text editor as they are needed in the next step. You can now close the FreeAgent Developer page.</p><p></p><p class='help'>Click the 'click to start' button. A new web page will open and you will be greeted by the following:</p><div class='step-image2'></div><p class='help'>Click on the 'ok thats fine' button and you will have a google page open within which the next steps are carried out.  If you have a google page open then click on the 'show steps' button back up at the top to see the next set of instructions.</p> "},
{"s1":"<p class='help'>The web page that is open is provided by google for companies that want to set up interface connectors called 'apis' that allow access to their data.</p><div class='step-image3'></div><p class='help'>To the right at 1. you will see two boxes for the two keys copied from the previous step.  Copy and paste each key into its respective box. (Sadly there is no consistency in names - the OAuth identifier key goes in the ClientID box, and the OAuth secret key into the other). There is no 'submit' button to press.  Over to the left at 2. click on the little arrow to the left of 'step 1' which will reveal the following.</p> <div class='step-image4'></div><p class='help'>At 3. you need to enter some text. A few characters will do, they play no role within this exercise however Google needs the box populated.  Then click on 'authorise apis' at step 4. A new window will open which is a FreeAgent login form.  Click on the 'show steps' button back at the top to see the next set of instructions.</p>"},
{"s2":"<p class='help'>This is the step that ensures that no unauthorised use of apis to access data can take place.  Enter your FreeAgent user name (email address) and password within the form and click 'Approve App'.</p> <div class='step-image5'></div><p class='help'>You will then be taken back to the earlier google page which will now be populated with an 'Authorisation Code'. Click on the 'show steps' button to see the next set of instructions.</p>"},
{"s3":"<p class='help'>Click on the 'Exchange Authorisation Code for Tokens' button at 5. and you will see the two boxes below, for the Access Token and Refresh Token, populate.</p><div class='step-image6'></div></p><p class='help'>Click on the 'show steps' button for the last part of the process.</p>"},
{"s4":"<p class='help'>Copy and paste the two tokens that appear into a word document or text editor as they will be needed for the final step.</p><div class='step-image7'></div><p class='help'>These two keys permit on-going access to the FreeAgent data.  The Access Token typically lasts 7 days. At any point up until the expiry of the Access Token, the Refresh Token can be used to obtain another Access Token providing another 7 days of access.  If the Access Token is allowed to expire, the process outlined in these help screens will need to be completed again.</p><p></p><p class='help'>The process for using the Refresh Token is explained using the 'show refresh steps' button above.</p><p></p><p class='help'>PLEASE COPY AND PASTE THE ACCESS TOKEN AND THE REFRESH TOKENS INTO THEIR RESPECTIVE BOXES ABOVE AND CLICK 'SUBMIT'."}
]
